---
kind: method
id: M:Autodesk.Revit.DB.IntersectionResultArrayIterator.#ctor
source: html/c2ebc211-1fe3-5705-053f-32970653acfc.htm
---
# Autodesk.Revit.DB.IntersectionResultArrayIterator.#ctor Method

For Internal Use Only.

## Syntax (C#)
```csharp
public IntersectionResultArrayIterator()
```

## Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.